<template>
  <div class="my-blogs">
    <navbar></navbar>
    <div class="container">
      <h1>TCP/IP协议四层模型</h1>
      <p>
        TCP（传输控制协议）/IP（网际协议） 简介 <br>
        TCP/IP协议是一系列网络协议的总和；包括：TCP，IP，UDP，ARP等，这些被称为子协议。在这些协议中，最重要、最著名的就是TCP和IP。因此，大部分网络管理员称整个协议族为“TCP/IP”它定义了电子设备如何接入互联网，以及数据如何在它们之间互相传输。<br>
        TCP/IP协议已成为建立计算机局域网、广域网的首选协议，已成为事实上的工业标准和国际标准。<br>
        TCP/IP 的作用？<br>
        解决了互联网中，数据怎么从一台主机传输到另外一台主机的问题。<br>
      </p>
      <p>
        什么是协议？<br>
        网络协议为计算机网络中进行数据交换而建立的规则、标准或约定的集合。<br>
        网络协议是由三个要素组成：<br>
        (1) 语义。语义是解释控制信息每个部分的意义。它规定了需要发出何种控制信息，以及完成的动作与做出什么     样的响应。（表示要做什么）<br>
        (2) 语法。语法是用户数据与控制信息的结构与格式，以及数据出现的顺序。（表示要怎么做）<br>
        (3) 时序。时序是对事件发生顺序的详细说明。（也可称为“同步”）。 （表示做的顺序)<br>
        TCP/IP 四层模型如下：<br>
        <img src="../img/8/1.png" alt="截图"><br>
      </p>
      <p>网络接口层：这是TCP/IP软件的最低层，负责接收IP数据包并通过网络发送之，或者从网络上接收物理帧，抽出IP数据报，交给IP层。(帧，网络接口协议)</p>
      <p>互连网络层：负责点到点（point-to-point）的传输（这里的"点"指主机或路由器）主要定义了IP地址格式,使得不同应用类型的数据在Internet上传输。提供基本的数据封包传送功能，让每一块数据包都能够到达目的主机（但不检查是否被正确接收），如网际协议（IP）</p>
      <p>传输层：提供端到端(end-to-end)的传输(这里的"端"指源主机到目标主机) 在此层中，它提供了节点间的数据传送服务，如传输控制协议（TCP）、用户数据报协议（UDP）等，TCP和UDP给数据包加入传输数据并把它传输到下一层中，这一层负责传送数据，并且确定数据已被送达并接收</p>
      <p>应用层 应用程序间沟通的层，如简单电子邮件传输(SMTP)文件传输协议（FTP）网络远程访问协议（Telnet）域名解析协议（DNS）等</p>
      <p>
        TCP/IP 三次握手四次挥手<br>
        <img src="../img/8/2.png" alt="截图"><br>
      </p>
      <p>建立连接协议（三次握手）第一次握手：客户端发送syn包（syn=x）的数据包到服务器，并进入SYN_SEND状态，等待服务器确认； <br>
        第二次握手：服务器收到syn包，必须确认客户的SYN（ack=x+1），同时自己也发送一个SYN包（syn=y），即SYN+ACK包，此时服务器进入SYN_RECV状态；<br>
        第三次握手：客户端收到服务器的SYN＋ACK包，向服务器发送确认包ACK(ack=y+1)，此包发送完毕，客户端和服务器进入ESTABLISHED状态，完成三次握手。<br>
        握手过程中传送的包里不包含数据，三次握手完毕后，客户端与服务器才正式开始传送数据。理想状态下，TCP连接一旦建立，在通信双方中的任何一方主动关闭连接之前，TCP连接都将被一直保持下去。<br>
      </p>
      <p>
        终止连接协议（四次挥手）<br>
        <span class="red">第一次挥手：</span>主动关闭方发送一个FIN，用来关闭主动方到被动关闭方的数据传送，也就是主动关闭方告诉被动关闭方：我已经不会再给你发数据了(当然，在fin包之前发送出去的数据，如果没有收到对应的ack确认报文，主动关闭方依然会重发这些数据)，但是，此时主动关闭方还可以接受数据。<br>
        <span class="red">第二次挥手：</span>被动关闭方收到FIN包后，发送一个ACK给对方，确认序号为收到序号+1（与SYN相同，一个FIN占用一个序号， SYN 和 FIN 都有seq序号）。<br>
        <span class="red">第三次挥手：</span>被动关闭方发送一个FIN，用来关闭被动关闭方到主动关闭方的数据传送，也就是告诉主动关闭方，我的数据也发送完了，不会再给你发数据了。<br>
        <span class="red">第四次挥手：</span>主动关闭方收到FIN后，发送一个ACK给被动关闭方，确认序号为收到序号+1完成四次挥手。
      </p>
    </div>
  </div>
</template>

<script>
import navbar from '@/views/index/navbar'

export default {
  name: 'my-blogs',
  components: {
    navbar
  },
  filters: {

  },
  data () {
    return {

    }
  },
  methods: {
    
  }
}
</script>

<style lang="less" scoped>
.my-blogs {
  .container {

  }
}
</style>